#Найдите сумму цифр трехзначного числа. Используйте f-строки чтобы оформить красивый вывод
#Например для числа 145 сумма цифр будет 10: 1 + 4 + 5
#Примеры/Тесты:
#123 >>> Сумма чисел числа 123 равна 6
#100 >>> Сумма чисел числа 100 равна 1
#(*) Усложнение. Решите для числа произвольной разрядности: произвольное количество цифр в числе.
#(**) Усложнение. Для числа произвольной разрядности добавить в вывод строку с числами, например так:
#13579 >>> Сумма чисел числа 13579 равна 25(1 + 3 + 5 + 7 + 9)

#Найдите сумму цифр трехзначного числа. Используйте f-строки чтобы оформить красивый вывод
"""
number = int(input("Введите трёхзначное чсло: "))
sot = number // 100
center = number // 10 % 10
end = number % 10
print (f"Сумма всех чисел {number} = {sot + center + end}")
"""

#(*) Усложнение. Решите для числа произвольной разрядности: произвольное количество цифр в числе.
"""
number = int(input("Введите число: "))
number_res = number
result = 0
while number >= 1:
    result = result + number % 10
    number = number // 10
print (f"Сумма всех чисел {number_res} = {result}")
"""

