#Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
#Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали 
#одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем 
#Петя и Сережа вместе?
#Примеры/Тесты:
#6 >>>  1  4  1
#24 >>> 4  16  4
#60 >>> 10  40  10


quantity = int(input("Введите количество журавликов: "))
if quantity % 6 == 0:
    print (F"Петя и Сережа Сделали по {int(quantity / 6)} шт, а Катя сделала {int(quantity / 6 * 4)} шт")
else:
    print("Число не подходит")